src/Documents/ОтражениеЗарплатыВУпрУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтражениеЗарплатыВУпрУчете</Name>
			<Comment>(Упр)</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CalculationRegisters/УправленческиеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>УправленческиеНачисления</Name>
			<Comment>(Упр)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.УправленческиеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВременнойСхемеМотивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСхемыМотивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыCхемМотивации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/InformationRegisters/УчетЗаработкаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетЗаработкаРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетНачисленийПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СпособыОтраженияЗарплатыВУпрУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВУпрУчете</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ОтражениеЗарплатыВУпрУчете/Ext/ObjectModule.bsl
Процедура Автозаполнение() Экспорт

	ОтражениеВУчете.Очистить();
	
	// ДанныеУпрУчета
	//	Поля:
	//		СтатьяЗатрат           	- статья затрат управленческго учета
	//		НоменклатурнаяГруппа	- номенклатурная группа управленческго учета
	//		Подразделение
	//		Результат
	//
	//	Описание:
	//	Содержит данные для отражения начисленй в упр. учете	
	
	ДанныеУпрУчетаТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|			ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|		КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|			ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|		ИНАЧЕ &парамСпособПоУмолчаниюСтатьяЗатрат
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|			ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|		КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|			ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|		ИНАЧЕ &парамСпособПоУмолчаниюНоменклатурнаяГруппа
	|	КОНЕЦ КАК НоменклатурнаяГруппа,
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|			ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|		КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|			ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|		ИНАЧЕ &парамСпособПоУмолчаниюОбъектСтроительства
	|	КОНЕЦ КАК ОбъектСтроительства,
	|	Начисления.Подразделение КАК Подразделение,
	|	СУММА(Начисления.Результат) КАК Сумма
	|ИЗ
	|	РегистрРасчета.УправленческиеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Начисления.ФизЛицо КАК ФизЛицо,
	|				МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|			ИЗ
	|				РегистрРасчета.УправленческиеНачисления КАК Начисления
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|					ПО Начисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|						И УчетЗаработкаРаботников.Период <= Начисления.ПериодДействияНачало
	|			ГДЕ
	|				Начисления.ПериодРегистрации = &парамПериодРегистрации
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Начисления.ФизЛицо) КАК СведенияОРаботникахСрез
	|			ПО СведенияОРаботникахСрез.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|				И СведенияОРаботникахСрез.Период = УчетЗаработкаРаботников.Период
	|		ПО УчетЗаработкаРаботников.Физлицо = Начисления.ФизЛицо
	|ГДЕ
	|	Начисления.ПериодРегистрации = &парамПериодРегистрации
	|	И ВЫБОР
	|			КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|					И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете
	|		КОНЕЦ <> &парамСпособНеОтражать
	|	И (НЕ Начисления.ПоВременнойСхемеМотивации)
	|	И (НЕ(Начисления.ВидРасчета.ЗачетОтработанногоВремени
	|				И (Начисления.Показатель1 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|					ИЛИ Начисления.Показатель2 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|					ИЛИ Начисления.Показатель3 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|					ИЛИ Начисления.Показатель4 = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка))))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|			ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|		КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|			ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|		ИНАЧЕ &парамСпособПоУмолчаниюСтатьяЗатрат
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|			ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|		КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|			ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|		ИНАЧЕ &парамСпособПоУмолчаниюНоменклатурнаяГруппа
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|			ТОГДА Начисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|		КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ
	|				И (НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL )
	|			ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|		ИНАЧЕ &парамСпособПоУмолчаниюОбъектСтроительства
	|	КОНЕЦ,
	|	Начисления.Подразделение";
	
	Запрос = Новый Запрос(ДанныеУпрУчетаТекст);
	
	Запрос.УстановитьПараметр("парамПустойСпособУУ", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособНеОтражать", Справочники.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпручете);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСтатьяЗатрат", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.СтатьяЗатрат);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюНоменклатурнаяГруппа", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюОбъектСтроительства", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.ОбъектСтроительства);
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтражениеВУчете.Добавить(),Выборка);
	КонецЦикла;
	
КонецПроцедуры //  Автозаполнение
